yang-8/run/adjointSourceOptimizationFoam/DominikFlow/constant/sourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// Linghui

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

x_source_1              x_source_1 [0 1 0 0 0 0 0] 9.0;
x_source_2              x_source_2 [0 1 0 0 0 0 0] 17.86;
x_source_3              x_source_3 [0 1 0 0 0 0 0] 11.95;
x_source_4              x_source_4 [0 1 0 0 0 0 0] 1.83;

y_source_1              y_source_1 [0 1 0 0 0 0 0] 6.0;
y_source_2              y_source_2 [0 1 0 0 0 0 0] 5.44;
y_source_3              y_source_3 [0 1 0 0 0 0 0] 8.25;
y_source_4              y_source_4 [0 1 0 0 0 0 0] 7.97;

x_source_5              x_source_5 [0 1 0 0 0 0 0] 6.47;
x_source_6              x_source_6 [0 1 0 0 0 0 0] 9.0;
x_source_7              x_source_7 [0 1 0 0 0 0 0] 0.14;
x_source_8              x_source_8 [0 1 0 0 0 0 0] 17.86;

y_source_5              y_source_5 [0 1 0 0 0 0 0] 11.91;
y_source_6              y_source_6 [0 1 0 0 0 0 0] 0.09;
y_source_7              y_source_7 [0 1 0 0 0 0 0] 4.03;
y_source_8              y_source_8 [0 1 0 0 0 0 0] 10.5;

x_source_9              x_source_9 [0 1 0 0 0 0 0] 11.53;
x_source_10             x_source_10 [0 1 0 0 0 0 0] 4.78;
x_source_11             x_source_11 [0 1 0 0 0 0 0] 7.31;
x_source_12             x_source_12 [0 1 0 0 0 0 0] 13.64;

y_source_9              y_source_9 [0 1 0 0 0 0 0] 3.75;
y_source_10             y_source_10 [0 1 0 0 0 0 0] 2.625;
y_source_11             y_source_11 [0 1 0 0 0 0 0] 10.5;
y_source_12             y_source_12 [0 1 0 0 0 0 0] 11.91;

sigma_source            sigma_source [0 0 0 0 0 0 0] 0.2;

// ************************************************************************* //
